meeting/agenda/2022/11-29.org
:PROPERTIES:
:ID:       107D72B9-7BA5-45A9-A6C5-ED1C39EF26D2
:END:
#+title: QT4 CG Meeting 013 Agenda 2022-11-29
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

Regrets for the next meeting?

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2022/11-22.html][the previous meeting]].

** Review of  open action items [8/9]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [X] QT4CG-012-01: MK to add a reference to the place in XSD where it says that value spaces are non-overlapping
  + See [[https://qt4cg.org/dashboard/#pr-271][pull request #271]]
+ [X] QT4CG-012-02: MK to point out the rules for union types are actually a bit more complex than described in section 2.2.1.
  + See [[https://qt4cg.org/dashboard/#pr-271][pull request #271]]
+ [X] QT4CG-012-03: MK to consider introducing schema element and schema element in 2.8
  + See [[https://qt4cg.org/dashboard/#pr-271][pull request #271]]
+ [X] QT4CG-012-04: MK to add “and also of other specific function types” to 2.8.
  + See [[https://qt4cg.org/dashboard/#pr-271][pull request #271]]
+ [X] QT4CG-012-05: NW to see if the presentation of the type hierarchy tables can be improved.
  + See [[https://qt4cg.org/dashboard/#pr-268][pull request #268]]
+ [X] QT4CG-012-06: MK to remove ~xs:untyped~ from the paragraph at the top of 2.8.2
  + See [[https://qt4cg.org/dashboard/#pr-271][pull request #271]]
+ [X] QT4CG-012-07: NW to work with MK to sort out the server build issues with PR #237
  + Resolved, merged
+ [X] QT4CG-012-08: NW to put the coercion rule changes on the agenda next week.

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

Pull request [[https://qt4cg.org/dashboard/#pr-253][#253]] is editorial or addresses infrastructure issues.

** Review the coercion rules
:PROPERTIES:
:CUSTOM_ID: coercion
:END:

See [[https://qt4cg.org/specifications/xquery-40/xpath-40.html#id-coercion-rules][4.4.3 Coercion Rules]] in [[https://qt4cg.org/specifications/xquery-40/xpath-40.html][XPath 4.0]]
See also [[https://qt4cg.org/dashboard/#pr-254][pull request #254]]

** Review pull request #250: fn:foot, etc.
:PROPERTIES:
:CUSTOM_ID: pr-fn-foot
:END:

See [[https://qt4cg.org/dashboard/#pr-250][pull request #250]]

** Review pull request #258: add array:index-where (issue #114)
:PROPERTIES:
:CUSTOM_ID: pr-array-index-where
:END:

See [[https://qt4cg.org/dashboard/#pr-258][pull request #258]]


** Review pull request #259: parse-html (issue #74)
:PROPERTIES:
:CUSTOM_ID: pr-parse-html
:END:

See [[https://qt4cg.org/dashboard/#pr-259][pull request #259]]

** Review pull request #268: type diagrams (issue #265)
:PROPERTIES:
:CUSTOM_ID: pr-type-diagrams
:END:

See [[https://qt4cg.org/dashboard/#pr-268][pull request #268]]

** Review pull request #271: data model changes
:PROPERTIES:
:CUSTOM_ID: pr-data-model
:END:

See [[https://qt4cg.org/dashboard/#pr-271][pull request #271]]

** Issue #170, XPath “otherwise” operator
:PROPERTIES:
:CUSTOM_ID: issue-170
:END:

MK [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html][proposes]] that [[https://github.com/qt4cg/qtspecs/issues/170][this issue]] may be ready to be decided.

** Issue #114, array:index-where
:PROPERTIES:
:CUSTOM_ID: issue-114
:END:

MK [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html][proposes]] that [[https://github.com/qt4cg/qtspecs/issues/114][this issue]] may be ready to be decided

** Issue #107, allow self::(a|b|c)
:PROPERTIES:
:CUSTOM_ID: issue-107
:END:

MK [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html][proposes]] that [[https://github.com/qt4cg/qtspecs/issues/107][this issue]] may be ready to be decided.

** XPath 4.0 functions
:PROPERTIES:
:CUSTOM_ID: xpath-40-functions
:END:

*** fn:duplicate-values
:PROPERTIES:
:CUSTOM_ID: fn-duplicate-values
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/123][#123]]
+ See also [[../../minutes/2022/10-04.html#h-782DCD58-658F-44BC-8AD7-1EE8301228F1][discussion from last meeting]]

*** fn:replace (action) 
:PROPERTIES:
:CUSTOM_ID: fn-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replace

*** fn:format-number (minor fixes)
:PROPERTIES:
:CUSTOM_ID: fn-format-number
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-format-number

*** fn:json
:PROPERTIES:
:CUSTOM_ID: fn-json
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-json

*** fn:differences
:PROPERTIES:
:CUSTOM_ID: fn-differences
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-differences

Editorially, this function is not ready for approval. We should decide
if we want to pursue it, and if we do, how.

*** fn:stack-trace
:PROPERTIES:
:CUSTOM_ID: fn-stack-trace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-stack-trace

*** +map:group-by+
:PROPERTIES:
:CUSTOM_ID: map-group-by
:END:
+ +See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-group-by+

Superceded by [[https://github.com/qt4cg/qtspecs/pull/203][map:build]], per [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0037.html][MK]].

*** map:replace
:PROPERTIES:
:CUSTOM_ID: map-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-replace

*** map:substitute
:PROPERTIES:
:CUSTOM_ID: map-substitute
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-substitute

*** map:entries
:PROPERTIES:
:CUSTOM_ID: map-entries
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/29][#29]] and [[https://github.com/qt4cg/qtspecs/issues/113][#113]]

*** array:replace
:PROPERTIES:
:CUSTOM_ID: array-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-replace

*** array:slice
:PROPERTIES:
:CUSTOM_ID: array-slice
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-slice

*** array:partition
:PROPERTIES:
:CUSTOM_ID: array-partition
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-partition

*** fn:parts
:PROPERTIES:
:CUSTOM_ID: fn-parts
:END:
+ See ???

*** fn:convert-to/from-EQName
:PROPERTIES:
:CUSTOM_ID: fn-convert-to-from-EQName
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/1][#1]]

*** fn:parse-html
:PROPERTIES:
:CUSTOM_ID: fn-parse-html
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/74][#74]]

*** fn:split-by-graphemes
:PROPERTIES:
:CUSTOM_ID: fn-split-by-graphemes
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/73][#73]]

*** fn:until
:PROPERTIES:
:CUSTOM_ID: fn-until
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/80][#80]]

*** fn:nl, fn:cr, fn:tab
:PROPERTIES:
:CUSTOM_ID: fn-nl-etc
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/121][#121]]

*** fn:deep-normalize-space
:PROPERTIES:
:CUSTOM_ID: fn-deep-normalize-space
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/79][#79]]

*** fn:parcel, fn:unparcel, array:from-members/of, array:members/parcels
:PROPERTIES:
:CUSTOM_ID: fn-parcel-etc
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/113][#113]]

*** array:values, map:values
:PROPERTIES:
:CUSTOM_ID: array-values-map-values
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/29][#29]]

*** fn:distinct-values (semantics)
:PROPERTIES:
:CUSTOM_ID: fn-distinct-values
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-distinct-values

*** fn:deep-equal (options)
:PROPERTIES:
:CUSTOM_ID: fn-deep-equal
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-deep-equal

*** fn:parse-json (number formatting)
:PROPERTIES:
:CUSTOM_ID: fn-parse-json
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-parse-json

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

