meeting/agenda/2022/11-29.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 013 Agenda 2022-11-29</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 013 Agenda 2022-11-29</h1>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.3.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
Regrets for the next meeting?
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.4.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2022/11-22.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of  open action items <code>[8/9]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="on"><code>[X]</code> QT4CG-012-01: MK to add a reference to the place in XSD where it says that value spaces are non-overlapping
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-271">pull request #271</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-02: MK to point out the rules for union types are actually a bit more complex than described in section 2.2.1.
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-271">pull request #271</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-03: MK to consider introducing schema element and schema element in 2.8
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-271">pull request #271</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-04: MK to add “and also of other specific function types” to 2.8.
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-271">pull request #271</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-05: NW to see if the presentation of the type hierarchy tables can be improved.
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-268">pull request #268</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-06: MK to remove <code>xs:untyped</code> from the paragraph at the top of 2.8.2
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-271">pull request #271</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-07: NW to work with MK to sort out the server build issues with PR #237
<ul class="org-ul">
<li>Resolved, merged</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-08: NW to put the coercion rule changes on the agenda next week.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
<p>
Pull request <a href="https://qt4cg.org/dashboard/#pr-253">#253</a> is editorial or addresses infrastructure issues.
</p>
</div>

<div id="outline-container-coercion" class="outline-3">
<h3 id="coercion"><span class="section-number-3">2.1.</span> Review the coercion rules</h3>
<div class="outline-text-3" id="text-coercion">
<p>
See <a href="https://qt4cg.org/specifications/xquery-40/xpath-40.html#id-coercion-rules">4.4.3 Coercion Rules</a> in <a href="https://qt4cg.org/specifications/xquery-40/xpath-40.html">XPath 4.0</a>
See also <a href="https://qt4cg.org/dashboard/#pr-254">pull request #254</a>
</p>
</div>
</div>

<div id="outline-container-pr-fn-foot" class="outline-3">
<h3 id="pr-fn-foot"><span class="section-number-3">2.2.</span> Review pull request #250: fn:foot, etc.</h3>
<div class="outline-text-3" id="text-pr-fn-foot">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-250">pull request #250</a>
</p>
</div>
</div>

<div id="outline-container-pr-array-index-where" class="outline-3">
<h3 id="pr-array-index-where"><span class="section-number-3">2.3.</span> Review pull request #258: add array:index-where (issue #114)</h3>
<div class="outline-text-3" id="text-pr-array-index-where">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-258">pull request #258</a>
</p>
</div>
</div>


<div id="outline-container-pr-parse-html" class="outline-3">
<h3 id="pr-parse-html"><span class="section-number-3">2.4.</span> Review pull request #259: parse-html (issue #74)</h3>
<div class="outline-text-3" id="text-pr-parse-html">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-259">pull request #259</a>
</p>
</div>
</div>

<div id="outline-container-pr-type-diagrams" class="outline-3">
<h3 id="pr-type-diagrams"><span class="section-number-3">2.5.</span> Review pull request #268: type diagrams (issue #265)</h3>
<div class="outline-text-3" id="text-pr-type-diagrams">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-268">pull request #268</a>
</p>
</div>
</div>

<div id="outline-container-pr-data-model" class="outline-3">
<h3 id="pr-data-model"><span class="section-number-3">2.6.</span> Review pull request #271: data model changes</h3>
<div class="outline-text-3" id="text-pr-data-model">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-271">pull request #271</a>
</p>
</div>
</div>

<div id="outline-container-issue-170" class="outline-3">
<h3 id="issue-170"><span class="section-number-3">2.7.</span> Issue #170, XPath “otherwise” operator</h3>
<div class="outline-text-3" id="text-issue-170">
<p>
MK <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html">proposes</a> that <a href="https://github.com/qt4cg/qtspecs/issues/170">this issue</a> may be ready to be decided.
</p>
</div>
</div>

<div id="outline-container-issue-114" class="outline-3">
<h3 id="issue-114"><span class="section-number-3">2.8.</span> Issue #114, array:index-where</h3>
<div class="outline-text-3" id="text-issue-114">
<p>
MK <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html">proposes</a> that <a href="https://github.com/qt4cg/qtspecs/issues/114">this issue</a> may be ready to be decided
</p>
</div>
</div>

<div id="outline-container-issue-107" class="outline-3">
<h3 id="issue-107"><span class="section-number-3">2.9.</span> Issue #107, allow self::(a|b|c)</h3>
<div class="outline-text-3" id="text-issue-107">
<p>
MK <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html">proposes</a> that <a href="https://github.com/qt4cg/qtspecs/issues/107">this issue</a> may be ready to be decided.
</p>
</div>
</div>

<div id="outline-container-xpath-40-functions" class="outline-3">
<h3 id="xpath-40-functions"><span class="section-number-3">2.10.</span> XPath 4.0 functions</h3>
<div class="outline-text-3" id="text-xpath-40-functions">
</div>

<div id="outline-container-fn-duplicate-values" class="outline-4">
<h4 id="fn-duplicate-values"><span class="section-number-4">2.10.1.</span> fn:duplicate-values</h4>
<div class="outline-text-4" id="text-fn-duplicate-values">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/123">#123</a></li>
<li>See also <a href="../../minutes/2022/10-04.html#h-782DCD58-658F-44BC-8AD7-1EE8301228F1">discussion from last meeting</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-replace" class="outline-4">
<h4 id="fn-replace"><span class="section-number-4">2.10.2.</span> fn:replace (action)</h4>
<div class="outline-text-4" id="text-fn-replace">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replace</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-format-number" class="outline-4">
<h4 id="fn-format-number"><span class="section-number-4">2.10.3.</span> fn:format-number (minor fixes)</h4>
<div class="outline-text-4" id="text-fn-format-number">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-format-number">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-format-number</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-json" class="outline-4">
<h4 id="fn-json"><span class="section-number-4">2.10.4.</span> fn:json</h4>
<div class="outline-text-4" id="text-fn-json">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-json">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-json</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-differences" class="outline-4">
<h4 id="fn-differences"><span class="section-number-4">2.10.5.</span> fn:differences</h4>
<div class="outline-text-4" id="text-fn-differences">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-differences">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-differences</a></li>
</ul>

<p>
Editorially, this function is not ready for approval. We should decide
if we want to pursue it, and if we do, how.
</p>
</div>
</div>

<div id="outline-container-fn-stack-trace" class="outline-4">
<h4 id="fn-stack-trace"><span class="section-number-4">2.10.6.</span> fn:stack-trace</h4>
<div class="outline-text-4" id="text-fn-stack-trace">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-stack-trace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-stack-trace</a></li>
</ul>
</div>
</div>

<div id="outline-container-map-group-by" class="outline-4">
<h4 id="map-group-by"><span class="section-number-4">2.10.7.</span> <del>map:group-by</del></h4>
<div class="outline-text-4" id="text-map-group-by">
<ul class="org-ul">
<li><del>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-group-by">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-group-by</a></del></li>
</ul>

<p>
Superceded by <a href="https://github.com/qt4cg/qtspecs/pull/203">map:build</a>, per <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0037.html">MK</a>.
</p>
</div>
</div>

<div id="outline-container-map-replace" class="outline-4">
<h4 id="map-replace"><span class="section-number-4">2.10.8.</span> map:replace</h4>
<div class="outline-text-4" id="text-map-replace">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-replace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-replace</a></li>
</ul>
</div>
</div>

<div id="outline-container-map-substitute" class="outline-4">
<h4 id="map-substitute"><span class="section-number-4">2.10.9.</span> map:substitute</h4>
<div class="outline-text-4" id="text-map-substitute">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-substitute">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-substitute</a></li>
</ul>
</div>
</div>

<div id="outline-container-map-entries" class="outline-4">
<h4 id="map-entries"><span class="section-number-4">2.10.10.</span> map:entries</h4>
<div class="outline-text-4" id="text-map-entries">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/29">#29</a> and <a href="https://github.com/qt4cg/qtspecs/issues/113">#113</a></li>
</ul>
</div>
</div>

<div id="outline-container-array-replace" class="outline-4">
<h4 id="array-replace"><span class="section-number-4">2.10.11.</span> array:replace</h4>
<div class="outline-text-4" id="text-array-replace">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-replace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-replace</a></li>
</ul>
</div>
</div>

<div id="outline-container-array-slice" class="outline-4">
<h4 id="array-slice"><span class="section-number-4">2.10.12.</span> array:slice</h4>
<div class="outline-text-4" id="text-array-slice">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-slice">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-slice</a></li>
</ul>
</div>
</div>

<div id="outline-container-array-partition" class="outline-4">
<h4 id="array-partition"><span class="section-number-4">2.10.13.</span> array:partition</h4>
<div class="outline-text-4" id="text-array-partition">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-partition">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-partition</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-parts" class="outline-4">
<h4 id="fn-parts"><span class="section-number-4">2.10.14.</span> fn:parts</h4>
<div class="outline-text-4" id="text-fn-parts">
<ul class="org-ul">
<li>See ???</li>
</ul>
</div>
</div>

<div id="outline-container-fn-convert-to-from-EQName" class="outline-4">
<h4 id="fn-convert-to-from-EQName"><span class="section-number-4">2.10.15.</span> fn:convert-to/from-EQName</h4>
<div class="outline-text-4" id="text-fn-convert-to-from-EQName">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/1">#1</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-parse-html" class="outline-4">
<h4 id="fn-parse-html"><span class="section-number-4">2.10.16.</span> fn:parse-html</h4>
<div class="outline-text-4" id="text-fn-parse-html">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/74">#74</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-split-by-graphemes" class="outline-4">
<h4 id="fn-split-by-graphemes"><span class="section-number-4">2.10.17.</span> fn:split-by-graphemes</h4>
<div class="outline-text-4" id="text-fn-split-by-graphemes">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/73">#73</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-until" class="outline-4">
<h4 id="fn-until"><span class="section-number-4">2.10.18.</span> fn:until</h4>
<div class="outline-text-4" id="text-fn-until">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/80">#80</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-nl-etc" class="outline-4">
<h4 id="fn-nl-etc"><span class="section-number-4">2.10.19.</span> fn:nl, fn:cr, fn:tab</h4>
<div class="outline-text-4" id="text-fn-nl-etc">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/121">#121</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-deep-normalize-space" class="outline-4">
<h4 id="fn-deep-normalize-space"><span class="section-number-4">2.10.20.</span> fn:deep-normalize-space</h4>
<div class="outline-text-4" id="text-fn-deep-normalize-space">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/79">#79</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-parcel-etc" class="outline-4">
<h4 id="fn-parcel-etc"><span class="section-number-4">2.10.21.</span> fn:parcel, fn:unparcel, array:from-members/of, array:members/parcels</h4>
<div class="outline-text-4" id="text-fn-parcel-etc">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/113">#113</a></li>
</ul>
</div>
</div>

<div id="outline-container-array-values-map-values" class="outline-4">
<h4 id="array-values-map-values"><span class="section-number-4">2.10.22.</span> array:values, map:values</h4>
<div class="outline-text-4" id="text-array-values-map-values">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/29">#29</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-distinct-values" class="outline-4">
<h4 id="fn-distinct-values"><span class="section-number-4">2.10.23.</span> fn:distinct-values (semantics)</h4>
<div class="outline-text-4" id="text-fn-distinct-values">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-distinct-values">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-distinct-values</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-deep-equal" class="outline-4">
<h4 id="fn-deep-equal"><span class="section-number-4">2.10.24.</span> fn:deep-equal (options)</h4>
<div class="outline-text-4" id="text-fn-deep-equal">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-deep-equal">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-deep-equal</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-parse-json" class="outline-4">
<h4 id="fn-parse-json"><span class="section-number-4">2.10.25.</span> fn:parse-json (number formatting)</h4>
<div class="outline-text-4" id="text-fn-parse-json">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-parse-json">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-parse-json</a></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
